Revit 2026 API

# PointOnEdgeSetEdgeReference Method

---

Change the edge or curve reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetEdgeReference(
	Reference reference
)
```
```vb
Public Sub SetEdgeReference (
	reference As Reference
)
```
```cpp
public:
void SetEdgeReference(
	Reference^ reference
)
```
```fsharp
member SetEdgeReference :
        reference : Reference -> unit
```

#### Parameters

reference Reference

The referenced element may be any model element, including FamilyInstance, FormElement, or CurveElement. The reference must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR.

#### Reference

PointOnEdge Class

Autodesk.Revit.DB Namespace